# Taps
tap "homebrew/bundle"
tap "termapps/tap"
tap "go-task/tap"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with MacOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Build tools
brew "autoconf"
brew "automake"

# Install Binaries
brew 'bash'
brew 'bat'
brew 'colima'
brew 'curl'
brew 'docker'
brew 'docker-credential-helper'
brew 'eza'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew "gh"
brew 'glab'
brew 'go-task'
brew 'htop'
brew 'jq'
brew 'lazygit'
brew 'nano'
brew 'neovim'
brew 'nss'
brew 'openssl'
brew 'ripgrep'
brew 'rsync'
brew 'scrcpy'
brew 'starship'
brew 'enquirer'
brew 'tmux'
brew 'trash'
brew 'watch'
brew 'wget'
brew 'yt-dlp'
brew 'z'

# Install backend development stuff
brew 'dive'
brew 'hadolint'
brew 'mkcert'

# Install frontend development stuff
brew 'mise'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'bluesnooze'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'fork'
cask 'itsycal'
cask 'jetbrains-toolbox'
cask 'kitty'
cask 'obsidian'
cask 'postman'
cask 'rar'
cask "raycast"
cask 'slack'
cask 'spotify'
cask 'syncthing'
cask 'ticktick'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
