# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/apache'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'imagemagick'
brew 'tree'
brew 'mackup'
brew 'memcached'
brew 'libmemcached'
brew 'nano'
brew 'node'
brew 'openssl'
brew 'rbenv'
brew 'ruby-build'
brew 'trash'
brew 'wget'
brew 'whois'
brew 'xctool'

# Install PHP stuff
brew 'php56'
brew 'php70'
brew 'mysql'
brew 'php56-mcrypt'
brew 'php70-mcrypt'
brew 'php56-memcached'
brew 'php70-memcached'
brew 'php56-imagick'
brew 'php70-imagick'
brew 'php56-xdebug'
brew 'php70-xdebug'
brew 'php56-opcache'
brew 'php70-opcache'

brew 'httpd24'


# Apps
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'phpstorm'
cask 'slack'
cask 'spotify'
cask 'sublime-text3'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
