# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with MacOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Binaries
brew 'bash'
brew 'dive'
brew 'docker-compose'
brew 'git'
brew 'git-delta'
brew 'glab'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'mkcert'
brew 'nano'
brew 'nss'
brew 'openssl'
brew 'pygments'
brew 'rbenv'
brew 'rsync'
brew 'ruby-build'
brew 'scrcpy'
brew 'watch'
brew 'wget'
brew 'whois'
brew 'youtube-dl'

# Install Frontend stuff
brew 'volta'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'

# Apps
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'boostnote'
cask 'docker'
cask 'fork'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'itsycal'
cask 'jetbrains-toolbox'
cask 'slack'
cask 'spotify'
cask 'java'
cask 'visual-studio-code'
cask 'whatsapp'
